<?php

namespace App\Consts;

class Consts
{
    const PREF_LIST = [
        "北海道", "青森県", "岩手県", "宮城県", "秋田県", "山形県", "福島県", "茨城県", "栃木県", "群馬県",
        "埼玉県", "千葉県", "東京都", "神奈川県", "新潟県", "富山県", "石川県", "福井県", "山梨県", "長野県",
        "岐阜県", "静岡県", "愛知県", "三重県", "滋賀県", "京都府", "大阪府", "兵庫県", "奈良県", "和歌山県",
        "鳥取県", "島根県", "岡山県", "広島県", "山口県", "徳島県", "香川県", "愛媛県", "高知県", "福岡県",
        "佐賀県", "長崎県", "熊本県", "大分県", "宮崎県", "鹿児島県", "沖縄県"
    ];

    const NG_WORDS = [
        'アナル', 'アヘン', 'インポ', '陰毛', 'インラン', 'うんこ', 'うんち', 'エロ', 'えっち', 'エッチ', 'おしっこ', 'おしり', 'おっぱい', 'おめこ',
        '顔射', 'きくもん', 'キャバ嬢', '巨乳', 'クンニ', '支那', '処女', '射精', 'スケベ', '素股', 'スカトロ', 'セクハラ', '絶倫', '前立腺',
        'チェリーボーイ', 'ちんこ', 'チンタ', 'つんぼ', 'ていんた', '手マン', '童貞', 'トップレス', '中出し', 'ニガー', 'ぱいおつ', '発情期', '貧乳', 'ファック',
        '風俗', 'フェラ', '部落', '変質者', 'ホモ', 'マリファナ', 'マンコ', 'まんこ', 'まんちょ', 'めくら', 'もっこり', 'レイプ', 'ロリコン', 'assww', 'Adolf Hitler',
        'DIO', 'fuck', 'PEE', 'SHEMALE', 'shit', '精液', '愛液',
        '人妻', '快感', 'セクロス', '生ハメ', 'おぱーい', 'せっくす', 'セックス', 'セフレ', '肉体関係', 'バイブ', 'チンポ', 'マン汁', '乳', 'ティンコ',
    ];
}
